In [1]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]
ages=[32,33,28,30,29]
country=["China", "Senegal", "España", "Norway","Korea"]
education=["Bach", "Bach", "Master", "PhD","PhD"]

In [2]:
ages[0]

32

In [3]:
age[0:4]

NameError: name 'age' is not defined

In [4]:
ages[0:4]

[32, 33, 28, 30]

In [5]:
ages[0:5]

[32, 33, 28, 30, 29]

In [6]:
ages[0:-1]

[32, 33, 28, 30]

In [7]:
country

['China', 'Senegal', 'España', 'Norway', 'Korea']

In [8]:
country[3] = "Spain"

In [9]:
country

['China', 'Senegal', 'España', 'Spain', 'Korea']

In [10]:
country[3] = "Norway"

In [11]:
country[2] = "Spain"

In [12]:
country

['China', 'Senegal', 'Spain', 'Norway', 'Korea']

In [13]:
weekend=("Friday", "Saturday", "Sunday")

In [14]:
weekend(0)

TypeError: 'tuple' object is not callable

In [15]:
weekend[0]

'Friday'

In [16]:
weekend[2]

'Sunday'

In [17]:
classroom={'student':names,'age':ages,'edu':education}

In [18]:
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD']}

In [19]:
classroom['student']

['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie']

In [20]:
classroom.update({'country':country})

In [21]:
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD'],
 'country': ['China', 'Senegal', 'Spain', 'Norway', 'Korea']}

In [22]:
import pandas

In [23]:
students=pandas.DataFrame(classroom)

In [24]:
students

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Raúl   28  Master    Spain
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea

In [25]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]

In [26]:
classroom.update({'student':names})

In [27]:
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD'],
 'country': ['China', 'Senegal', 'Spain', 'Norway', 'Korea']}

In [28]:
pandas.DataFrame(classroom)

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Raúl   28  Master    Spain
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea

In [29]:
names=["Qing", "Françoise", "Raúl", "Bjork"]

In [30]:
classroom.update({'student':names})

In [31]:
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD'],
 'country': ['China', 'Senegal', 'Spain', 'Norway', 'Korea']}

In [32]:
pandas.DataFrame(classroom)

ValueError: All arrays must be of the same length

In [33]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]

In [34]:
classroom.update({'student':names})

In [35]:
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD'],
 'country': ['China', 'Senegal', 'Spain', 'Norway', 'Korea']}

In [36]:
pandas.dataframe(classroom)

AttributeError: module 'pandas' has no attribute 'dataframe'

In [37]:
pandas.DataFrame(classroom)

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Raúl   28  Master    Spain
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea

In [38]:
students

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Raúl   28  Master    Spain
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea

In [39]:
type(students)

pandas.core.frame.DataFrame

In [40]:
students.dtypes

student    object
age         int64
edu        object
country    object
dtype: object

In [41]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   student  5 non-null      object
 1   age      5 non-null      int64
 2   edu      5 non-null      object
 3   country  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [42]:
students.shape

(5, 4)

In [43]:
len(students)

5

In [44]:
students.head(2)

     student  age   edu  country
0       Qing   32  Bach    China
1  Françoise   33  Bach  Senegal

In [45]:
students.tail(2)

  student  age  edu country
3   Bjork   30  PhD  Norway
4   Marie   29  PhD   Korea

In [46]:
students.country

0      China
1    Senegal
2      Spain
3     Norway
4      Korea
Name: country, dtype: object

In [47]:
students[['country','student']]

   country    student
0    China       Qing
1  Senegal  Françoise
2    Spain       Raúl
3   Norway      Bjork
4    Korea      Marie